part of '../flutter3_vector.dart';

///
/// @author <a href="mailto:angcyo@126.com">angcyo</a>
/// @date 2024/03/29
///
/// # GCode 常用指令
///
/// - `G20` 英寸单位, `默认`
/// - `G21` 毫米单位
/// - ---
/// - `G90` 绝对位置/绝对距离模式 `默认`
/// - `G91` 相对位置/增量距离模式
/// - ---
/// - `G0` moveTo
/// - `G1` lineTo
/// - `G2` 顺时针画弧 `G2 X100 Y100 I50 J50`
/// - `G3` 逆时针画弧
/// - ---
/// - `M2、M30` 程序结束
///     - `M2` - 结束程序。
///     - `M30` - 交换托盘穿梭车并结束程序。
/// - `M3、M4、M5` 主轴控制
///     - `M3` - 以 S 速度顺时针启动选定的主轴。
///     - `M4` - 以 S 速度逆时针启动选定的主轴。
///     - `M5` - 停止选定的主轴。
/// - `M7、M8、M9` 冷却液控制
///     - `M7` 打开雾化冷却液
///     - `M8` 打开溢流冷却液
///     - `M9` 关闭`M7`和`M8`。
/// - `M5/M05` 关闭主轴,所有`G`操作, 都变成`moveTo`
/// - `M3/M03` 打开主轴
/// - `M4/M04` 自动激光
/// - ---
/// - `S255` `S0` 出光功率
///
/// # GCode 其他指令
///
/// - `G0/G00` 快速协调运动
/// - `G17-G19.1` 平面选择坐标系选择
/// - `G17` `XY`
/// - `G18` `ZX`
/// - `G19` `YZ`
/// - `G40` 关闭刀具补偿
/// - `G54-G59.3` 选择坐标系
///
/// M 代码命令，常与 G 代码一起在程序中使用。以下是一些常见的 M 代码命令：
///
/// M00 – 程序停止
/// M02 – 程序结束
/// M03 – 主轴开启 – 顺时针
/// M04 – 主轴开启 – 逆时针
/// M05 – 主轴停止
/// M06 – 换刀
/// M08 – 开启冷却夜
/// M09 – 关闭冷却液
/// M30 – 程序结束
///
/// ```
/// G90
/// G21
/// M03S255
/// G0X0Y0
/// G1X100Y0
/// G1X100Y100
/// G1X0Y100
/// G1X0Y0
/// M05S0
/// ```
class GCode {}
