part of '../flutter3_vector.dart';

///
/// @author <a href="mailto:angcyo@126.com">angcyo</a>
/// @date 2024/03/29
///
/// # GCode 常用指令
/// - `G20` 英寸单位
/// - `G21` 毫米单位
/// - ---
/// - `G90` 绝对位置
/// - `G91` 相对位置
/// - ---
/// - `G0` moveTo
/// - `G1` lineTo
/// - `G2` 顺时针画弧
/// - `G3` 逆时针画弧
/// - ---
/// - `M05` 关闭主轴,所有`G`操作, 都变成`moveTo`
/// - `M03` 打开主轴
///
/// M 代码命令，常与 G 代码一起在程序中使用。以下是一些常见的 M 代码命令：
///
/// M00 – 程序停止
/// M02 – 程序结束
/// M03 – 主轴开启 – 顺时针
/// M04 – 主轴开启 – 逆时针
/// M05 – 主轴停止
/// M06 – 换刀
/// M08 – 开启冷却夜
/// M09 – 关闭冷却液
/// M30 – 程序结束
///
/// ```
/// G90
/// G21
/// M03S255
/// G0X0Y0
/// G1X100Y0
/// G1X100Y100
/// G1X0Y100
/// G1X0Y0
/// M05S0
/// ```
class GCode {}
